# Definition Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
Definition Methods
Definition Class See Also
---
The Definition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter. |
| GetGroupTypeId | Returns the identifier of the parameter definition's parameter group. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSpecTypeId | **Obsolete.** Gets the identifier of the spec describing values of the parameter. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
Definition Class
Autodesk.Revit.DB Namespace